EmbeddedSystemClass/STM32_IMS_CONTROLLER/Source/freemodbus/port/mbport.c
#include "mb.h"
#include "fram_i2c.h"
#include "stm32f4xx_rtc.h"
#include "controller.h"
#include "log.h"

void ENTER_CRITICAL_SECTION(void)
{

}

void EXIT_CRITICAL_SECTION(void)
{

}

#define CURRENT_CHANNEL_0	2
#define CURRENT_CHANNEL_1	3
#define CURRENT_CHANNEL_2	1
#define CURRENT_CHANNEL_3	0
#define CURRENT_CHANNEL_4	6
#define CURRENT_CHANNEL_5	7
#define CURRENT_CHANNEL_6	5
#define CURRENT_CHANNEL_7	4

#define REG_FREQUENCY_0			0
#define REG_FREQUENCY_1			2
#define REG_PULSE_COUNTER_0		4
#define REG_PULSE_COUNTER_1		6
#define REG_RTD_0				8
#define REG_RTD_1				10

#define REG_CURRENT_0			12
#define REG_CURRENT_1			14
#define REG_CURRENT_2			16
#define REG_CURRENT_3			18
#define REG_CURRENT_4			20
#define REG_CURRENT_5			22
#define REG_CURRENT_6			24
#define REG_CURRENT_7			26

#define REG_CURRENT_RAW_0		28
#define REG_CURRENT_RAW_1		30
#define REG_CURRENT_RAW_2		32
#define REG_CURRENT_RAW_3		34
#define REG_CURRENT_RAW_4		36
#define REG_CURRENT_RAW_5		38
#define REG_CURRENT_RAW_6		40
#define REG_CURRENT_RAW_7		42


u8 REG_INPUT_START=1,REG_HOLDING_START=1;
u8 REG_INPUT_NREGS=50,REG_HOLDING_NREGS=80;
u8 usRegInputStart=1,usRegHoldingStart=1;


eMBErrorCode
eMBRegInputCB( UCHAR * pucRegBuffer, USHORT usAddress, USHORT usNRegs )
{
	eMBErrorCode    eStatus = MB_ENOERR;
	int             iRegIndex;
	u16 usRegInputBuf[REG_INPUT_NREGS];

    xSemaphoreTake( xMeasureDataMutex, portMAX_DELAY );
    {
//    	((float*)usRegInputBuf)[0]=stMeasureData.frequency[0];
//    	((float*)usRegInputBuf)[1]=stMeasureData.frequency[1];
//    	((uint32_t*)usRegInputBuf)[2]=(uint32_t)stMeasureData.pulse_counter[0];
//    	((uint32_t*)usRegInputBuf)[3]=(uint32_t)stMeasureData.pulse_counter[1];
//    	((float*)usRegInputBuf)[4]=stMeasureData.rtd[0];
//    	((float*)usRegInputBuf)[5]=stMeasureData.rtd[1];
//    	((float*)usRegInputBuf)[6]=stMeasureData.current[CURRENT_CHANNEL_0];
//    	((float*)usRegInputBuf)[7]=stMeasureData.current[CURRENT_CHANNEL_1];
//    	((float*)usRegInputBuf)[8]=stMeasureData.current[CURRENT_CHANNEL_2];
//    	((float*)usRegInputBuf)[9]=stMeasureData.current[CURRENT_CHANNEL_3];
//    	((float*)usRegInputBuf)[10]=stMeasureData.current[CURRENT_CHANNEL_4];
//    	((float*)usRegInputBuf)[11]=stMeasureData.current[CURRENT_CHANNEL_5];
//    	((float*)usRegInputBuf)[12]=stMeasureData.current[CURRENT_CHANNEL_6];
//    	((float*)usRegInputBuf)[13]=stMeasureData.current[CURRENT_CHANNEL_7];
//
//    	((uint32_t*)usRegInputBuf)[14]=stMeasureData.current_raw[CURRENT_CHANNEL_0];
//    	((uint32_t*)usRegInputBuf)[15]=stMeasureData.current_raw[CURRENT_CHANNEL_1];
//    	((uint32_t*)usRegInputBuf)[16]=stMeasureData.current_raw[CURRENT_CHANNEL_2];
//    	((uint32_t*)usRegInputBuf)[17]=stMeasureData.current_raw[CURRENT_CHANNEL_3];
//    	((uint32_t*)usRegInputBuf)[18]=stMeasureData.current_raw[CURRENT_CHANNEL_4];
//    	((uint32_t*)usRegInputBuf)[19]=stMeasureData.current_raw[CURRENT_CHANNEL_5];
//    	((uint32_t*)usRegInputBuf)[20]=stMeasureData.current_raw[CURRENT_CHANNEL_6];
//    	((uint32_t*)usRegInputBuf)[21]=stMeasureData.current_raw[CURRENT_CHANNEL_7];

    	*((float*)&usRegInputBuf[REG_FREQUENCY_0])=stMeasureData.frequency[0];
    	*((float*)&usRegInputBuf[REG_FREQUENCY_1])=stMeasureData.frequency[1];
    	*((uint32_t*)&usRegInputBuf[REG_PULSE_COUNTER_0])=(uint32_t)stMeasureData.pulse_counter[0];
    	*((uint32_t*)&usRegInputBuf[REG_PULSE_COUNTER_1])=(uint32_t)stMeasureData.pulse_counter[1];
    	*((float*)&usRegInputBuf[REG_RTD_0])=stMeasureData.rtd[0];
    	*((float*)&usRegInputBuf[REG_RTD_1])=stMeasureData.rtd[1];
    	*((float*)&usRegInputBuf[REG_CURRENT_0])=stMeasureData.current[CURRENT_CHANNEL_0];
    	*((float*)&usRegInputBuf[REG_CURRENT_1])=stMeasureData.current[CURRENT_CHANNEL_1];
    	*((float*)&usRegInputBuf[REG_CURRENT_2])=stMeasureData.current[CURRENT_CHANNEL_2];
    	*((float*)&usRegInputBuf[REG_CURRENT_3])=stMeasureData.current[CURRENT_CHANNEL_3];
    	*((float*)&usRegInputBuf[REG_CURRENT_4])=stMeasureData.current[CURRENT_CHANNEL_4];
    	*((float*)&usRegInputBuf[REG_CURRENT_5])=stMeasureData.current[CURRENT_CHANNEL_5];
    	*((float*)&usRegInputBuf[REG_CURRENT_6])=stMeasureData.current[CURRENT_CHANNEL_6];
    	*((float*)&usRegInputBuf[REG_CURRENT_7])=stMeasureData.current[CURRENT_CHANNEL_7];

    	*((uint32_t*)&usRegInputBuf[REG_CURRENT_RAW_0])=stMeasureData.current_raw[CURRENT_CHANNEL_0];
    	*((uint32_t*)&usRegInputBuf[REG_CURRENT_RAW_1])=stMeasureData.current_raw[CURRENT_CHANNEL_1];
    	*((uint32_t*)&usRegInputBuf[REG_CURRENT_RAW_2])=stMeasureData.current_raw[CURRENT_CHANNEL_2];
    	*((uint32_t*)&usRegInputBuf[REG_CURRENT_RAW_3])=stMeasureData.current_raw[CURRENT_CHANNEL_3];
    	*((uint32_t*)&usRegInputBuf[REG_CURRENT_RAW_4])=stMeasureData.current_raw[CURRENT_CHANNEL_4];
    	*((uint32_t*)&usRegInputBuf[REG_CURRENT_RAW_5])=stMeasureData.current_raw[CURRENT_CHANNEL_5];
    	*((uint32_t*)&usRegInputBuf[REG_CURRENT_RAW_6])=stMeasureData.current_raw[CURRENT_CHANNEL_6];
    	*((uint32_t*)&usRegInputBuf[REG_CURRENT_RAW_7])=stMeasureData.current_raw[CURRENT_CHANNEL_7];
    }
    xSemaphoreGive( xMeasureDataMutex );

    if( ( usAddress >= REG_INPUT_START )&& ( usAddress + usNRegs <= REG_INPUT_START + REG_INPUT_NREGS ) )
    {
        iRegIndex = ( int )( usAddress - usRegInputStart );
        while( usNRegs > 0 )
        {
            *pucRegBuffer++ =
                ( unsigned char )( usRegInputBuf[iRegIndex] >> 8 );
            *pucRegBuffer++ =
                ( unsigned char )( usRegInputBuf[iRegIndex] & 0xFF );
            iRegIndex++;
            usNRegs--;
        }
    }
    else
    {
        eStatus = MB_ENOREG;
    }

    return eStatus;
}


#define REG_RTC_SECOND			0
#define REG_RTC_MINUTE			1
#define REG_RTC_HOUR			2
#define REG_RTC_DAY_OF_MONTH	3
#define REG_RTC_MONTH			4
#define REG_RTC_YEAR			5
#define REG_RTC_DAY_OF_WEEK		6
#define REG_TCXO_FREQ			7

#define REG_CUR0_CODE_PNT0		9
#define REG_CUR0_MA_PNT0		11
#define REG_CUR0_CODE_PNT1		13
#define REG_CUR0_MA_PNT1		15

#define REG_CUR1_CODE_PNT0		17
#define REG_CUR1_MA_PNT0		19
#define REG_CUR1_CODE_PNT1		21
#define REG_CUR1_MA_PNT1		23

#define REG_CUR2_CODE_PNT0		25
#define REG_CUR2_MA_PNT0		27
#define REG_CUR2_CODE_PNT1		29
#define REG_CUR2_MA_PNT1		31

#define REG_CUR3_CODE_PNT0		33
#define REG_CUR3_MA_PNT0		35
#define REG_CUR3_CODE_PNT1		37
#define REG_CUR3_MA_PNT1		39

#define REG_CUR4_CODE_PNT0		41
#define REG_CUR4_MA_PNT0		43
#define REG_CUR4_CODE_PNT1		45
#define REG_CUR4_MA_PNT1		47

